In [1]:
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt
import seaborn as sns

import warnings
warnings.filterwarnings('ignore')

In [9]:
import os
os.chdir('dataset/')

In [11]:
import glob
glob.glob('*.csv')

['application_record.csv', 'credit_record.csv']

In [14]:
dfs = {}

for i in glob.glob('*.csv'):
    dfs[i[:-4]] = pd.read_csv(i)
    
for i in dfs.keys():
    dfs[i].columns = [j.lower() for j in dfs[i].columns]

In [15]:
dfs.keys()

dict_keys(['application_record', 'credit_record'])

In [17]:
dfs['application_record'].head()

,id,code_gender,flag_own_car,flag_own_realty,cnt_children,amt_income_total,name_income_type,name_education_type,name_family_status,name_housing_type,days_birth,days_employed,flag_mobil,flag_work_phone,flag_phone,flag_email,occupation_type,cnt_fam_members
0,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
1,5008805,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
2,5008806,M,Y,Y,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,-21474,-1134,1,0,0,0,Security staff,2.0
3,5008808,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0
4,5008809,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0

In [18]:
dfs['credit_record'].head()

        id  months_balance status
0  5001711               0      X
1  5001711              -1      0
2  5001711              -2      0
3  5001711              -3      0
4  5001712               0      C

In [20]:
df = pd.merge(dfs['application_record'], dfs['credit_record'], on = 'id', how = 'inner')
df.shape

(777715, 20)

# Preprocessing

In [23]:
df.isna().sum()

id                          0
code_gender                 0
flag_own_car                0
flag_own_realty             0
cnt_children                0
amt_income_total            0
name_income_type            0
name_education_type         0
name_family_status          0
name_housing_type           0
days_birth                  0
days_employed               0
flag_mobil                  0
flag_work_phone             0
flag_phone                  0
flag_email                  0
occupation_type        240048
cnt_fam_members             0
months_balance              0
status                      0
dtype: int64

In [21]:
df.id.nunique()

36457

In [22]:
df['id'].value_counts()

id
5090630    61
5148524    61
5066707    61
5061848    61
5118380    61
           ..
5024557     1
5062311     1
5024365     1
5024364     1
5041568     1
Name: count, Length: 36457, dtype: int64

In [24]:
df[df['id'] == 5090630].head()

,id,code_gender,flag_own_car,flag_own_realty,cnt_children,amt_income_total,name_income_type,name_education_type,name_family_status,name_housing_type,days_birth,days_employed,flag_mobil,flag_work_phone,flag_phone,flag_email,occupation_type,cnt_fam_members,months_balance,status
452126,5090630,F,N,Y,0,180000.0,Pensioner,Secondary / secondary special,Married,House / apartment,-19983,365243,1,0,0,1,NaN,2.0,0,X
452127,5090630,F,N,Y,0,180000.0,Pensioner,Secondary / secondary special,Married,House / apartment,-19983,365243,1,0,0,1,NaN,2.0,-1,X
452128,5090630,F,N,Y,0,180000.0,Pensioner,Secondary / secondary special,Married,House / apartment,-19983,365243,1,0,0,1,NaN,2.0,-2,X
452129,5090630,F,N,Y,0,180000.0,Pensioner,Secondary / secondary special,Married,House / apartment,-19983,365243,1,0,0,1,NaN,2.0,-3,X
452130,5090630,F,N,Y,0,180000.0,Pensioner,Secondary / secondary special,Married,House / apartment,-19983,365243,1,0,0,1,NaN,2.0,-4,X

In [25]:
df[df['id'] == 5090630]['occupation_type'].isna().sum()

61

In [26]:
for cols in df.columns:
    print(f'{cols} :: {df[cols].unique()}')

id :: [5008804 5008805 5008806 ... 5149838 5150049 5150337]
code_gender :: ['M' 'F']
flag_own_car :: ['Y' 'N']
flag_own_realty :: ['Y' 'N']
cnt_children :: [ 0  1  3  2  4  5 14 19  7]
amt_income_total :: [ 427500.   112500.   270000.   283500.   135000.   130500.   157500.
  405000.   211500.   360000.   126000.   315000.   247500.   297000.
  225000.   166500.   216000.   255150.   148500.   202500.    94500.
  450000.   180000.    90000.   765000.   382500.   144000.   229500.
  292500.    74250.    40500.   337500.   193500.   267750.   139500.
   67500.   252000.   900000.   115290.   279000.    76500.   234000.
   81000.   108000.    99000.   198000.    45000.   238500.   117000.
  153000.  1350000.   445500.   495000.    85500.   306000.   562500.
  189000.   328500.   310500.   540000.   171000.   675000.   121500.
   72000.    65250.   184500.   103500.   162000.   165150.    54000.
  243000.   256500.    33300.   697500.   101250.    58500.   110250.
  472500.   196650.   630000.   432000.   257625.   143100.   207000.
  288000.   131400.   720000.   261000.    99900.    38250.   175500.
   49500.    83250.   119250.    63000.   274500.    90900.   220500.
   47250.   585000.   139050.    33750.   145350.   173250.   531000.
  387000.  1125000.    36000.   179100.   206100.   265500.   118350.
  123750.   116653.5  133650.   324000.   351000.   441000.   227250.
   51750.   517500.   396000.   810000.   178650.   165600.    69750.
   46948.5  616500.   378000.    89550.   234135.    42300.    74061.
  175950.   168750.   391500.   177012.   364500.   661500.   240750.
  333000.   342000.   167400.    50850.   141750.   176400.    30150.
  155250.   414000.    52650.   115200.    67050.   120150.   373500.
  146250.   213750.   121900.5  231750.   346500.   191250.   132372.
  159750.   132750.    91530.    97731.   170302.5  265581.    73575.
  184135.5  160200.   191700.   253800.    56700.   369000.   176175.
  134419.5  190399.5  716323.5   31500.    57150.    78750.   236250.
  208350.    38700.   222750.    72900.    56250.    62653.5  113400.
   92250.   607500.   215550.    44550.   161100.   122400.    60376.5
  254700.   787500.   140400.   185400.    31950.   129150.   612000.
   47790.    69372.   134995.5  177750.   301500.   594000.   164250.
   60750.    45900.   171261.   128542.5  178200.    73350.   124200.
   82350.    38025.   360450.    39600.   634500.   459000.    87750.
  945000.   463500.   742500.   151200.   560250.    89100.   204750.
   36900.   187650.    32400.   147150.   119700.    27000.   990000.
   61875.   355500.    79650.    37800.   140850.   195750.    29250.
  423000.    87448.5  326250.    31531.5  105750.   468000.    97650.
  114750.   418500.    95850.   652500.  1575000.    74700.    62100.
  494100.   249750.   150750.   116100.   215100.   179271. ]
name_income_type :: ['Working' 'Commercial associate' 'Pensioner' 'State servant' 'Student']
name_education_type :: ['Higher education' 'Secondary / secondary special' 'Incomplete higher'
 'Lower secondary' 'Academic degree']
name_family_status :: ['Civil marriage' 'Married' 'Single / not married' 'Separated' 'Widow']
name_housing_type :: ['Rented apartment' 'House / apartment' 'Municipal apartment'
 'With parents' 'Co-op apartment' 'Office apartment']
days_birth :: [-12005 -21474 -19110 ... -21590 -15837  -9188]
days_employed :: [ -4542  -1134  -3051 ...  -8161   -606 -11272]
flag_mobil :: [1]
flag_work_phone :: [1 0]
flag_phone :: [0 1]
flag_email :: [0 1]
occupation_type :: [nan 'Security staff' 'Sales staff' 'Accountants' 'Laborers' 'Managers'
 'Drivers' 'Core staff' 'High skill tech staff' 'Cleaning staff'
 'Private service staff' 'Cooking staff' 'Low-skill Laborers'
 'Medicine staff' 'Secretaries' 'Waiters/barmen staff' 'HR staff'
 'Realty agents' 'IT staff']
cnt_fam_members :: [ 2.  1.  5.  3.  4.  6. 15.  7. 20.  9.]
months_balance :: [  0  -1  -2  -3  -4  -5  -6  -7  -8  -9 -10 -11 -12 -13 -14 -15 -16 -17
 -18 -19 -20 -21 -22 -23 -24 -25 -26 -27 -28 -29 -30 -31 -32 -33 -34 -35
 -36 -37 -38 -39 -40 -41 -42 -43 -44 -45 -46 -47 -48 -49 -50 -51 -52 -53
 -54 -55 -56 -57 -58 -59 -60]
status :: ['C' '1' '0' 'X' '5' '4' '3' '2']

In [29]:
cols_with_2_unique_val = []

for cols in df.columns:
    if df[cols].nunique() == 2:
        cols_with_2_unique_val.append(cols)
        
df1 = df.drop(columns = cols_with_2_unique_val)
df2 = df[cols_with_2_unique_val]
df2 = pd.get_dummies(df2)

In [31]:
df1.head()

,id,cnt_children,amt_income_total,name_income_type,name_education_type,name_family_status,name_housing_type,days_birth,days_employed,flag_mobil,occupation_type,cnt_fam_members,months_balance,status
0,5008804,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,NaN,2.0,0,C
1,5008804,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,NaN,2.0,-1,C
2,5008804,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,NaN,2.0,-2,C
3,5008804,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,NaN,2.0,-3,C
4,5008804,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,NaN,2.0,-4,C

In [30]:
df1.columns

Index(['id', 'cnt_children', 'amt_income_total', 'name_income_type',
       'name_education_type', 'name_family_status', 'name_housing_type',
       'days_birth', 'days_employed', 'flag_mobil', 'occupation_type',
       'cnt_fam_members', 'months_balance', 'status'],
      dtype='object')

    days_birth days_employed

In [32]:
df1.days_birth.describe()

count    777715.000000
mean     -16124.937046
std        4104.304018
min      -25152.000000
25%      -19453.000000
50%      -15760.000000
75%      -12716.000000
max       -7489.000000
Name: days_birth, dtype: float64